trade/src/Documents/ЭлектроннаяСопроводительнаяВедомость/ЭлектроннаяСопроводительнаяВедомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектроннаяСопроводительнаяВедомость</name>
  <posting>Deny</posting>
  <attributes>
    <name>ТитулПеревозчикаИдентификаторФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаДатаФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаВремяФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИДМинтранс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаПорядковыйНомерСопроводительнойВедомости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулПеревозчикаДатаСоставленияСопроводительнойВедомости</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулПеревозчикаГрузоотправитель</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулПеревозчикаГрузополучатель</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаТитулПеревозчикаПеревозчик</name>
    <type>
      <types>DefinedType.УчастникЭДО_ЭПД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяИдентификаторФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяДатаФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузоотправителяВремяФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузополучателяИдентификаторФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузополучателяДатаФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТитулГрузополучателяВремяФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопТитулПеревозчикаИдентификаторФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопТитулПеревозчикаДатаФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопТитулПеревозчикаВремяФормированияФайла</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийПолученныйТитул</name>
    <type>
      <types>EnumRef.ТипыЭлементовРегламентаЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийТитул</name>
    <type>
      <types>EnumRef.ТипыЭлементовРегламентаЭДО</types>
    </type>
  </attributes>
  <attributes>
    <name>РольУчастника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГрузоотправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГрузополучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>46</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийШаг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийШагВыполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеПолучателиСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.ДокументыОснованияЭСВ_ЭПД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/Documents/ЭлектроннаяСопроводительнаяВедомость/ManagerModule.bsl
//@skip-check doc-comment-parameter-section

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
	
// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТитулПеревозчикаПорядковыйНомерСопроводительнойВедомости");
	Поля.Добавить("ЭтоВходящий");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Номер = Данные.Номер;
	Направление = "";
	Если ЗначениеЗаполнено(Данные.ТитулПеревозчикаПорядковыйНомерСопроводительнойВедомости) Тогда
		Номер = Данные.ТитулПеревозчикаПорядковыйНомерСопроводительнойВедомости;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ЭтоВходящий) Тогда
		Направление = ?(Данные.ЭтоВходящий, " " + НСтр("ru = 'входящая'"), "");
	КонецЕсли;
	Дата = Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Электронная сопроводительная ведомость%1 № %2 от %3'"), Направление, Номер, Дата);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
